tenant_template_esbinput/api_deploy/api__deploy__tenant__addRole.xml

<@pp.dropOutputFile />
<@pp.changeOutputFile name="api__deploy__"+tenant.code+"__addRole.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:addRole>
         <xsd:roleName>mb-topic-all-input.${tenant.code}</xsd:roleName>
         <xsd:isSharedRole>false</xsd:isSharedRole>
      </xsd:addRole>
   </soapenv:Body>
</soapenv:Envelope>